examples/flows/compiled/if_else_simple/flow.mmd
flowchart TD
    %% Flow: if_else_simple_flow

    handler_finalize([handler_finalize])
    handler_setup[handler_setup]
    handler_type_a[handler_type_a]
    handler_type_b[handler_type_b]
    router_if_else_simple_flow_line_14_if_1{{router_if_else_simple_flow_line_14_if_1}}
    start_if_else_simple_flow([start_if_else_simple_flow])

    start_if_else_simple_flow --> handler_setup
    handler_setup --> router_if_else_simple_flow_line_14_if_1
    router_if_else_simple_flow_line_14_if_1 -->|p['type'] == 'A'| handler_type_a
    handler_type_a --> handler_finalize
    router_if_else_simple_flow_line_14_if_1 -->|not (p['type'] == 'A')| handler_type_b
    handler_type_b --> handler_finalize
